// برنامه ای بنویسید که اعداد یک تا چهار را چاپ کند همه اعداد با یک فاصله از یک دیگر باشد 
// این کار به خوانایی برنامه کمک میکند 
// این برنامه را بااستفاده از یک دستور خروجی و یک عملگر درج در جریان باشد 
// و یک دستور خروجی و چهار عملگر درج در جریان 

#include <iostream > 
using namespace std ; 

int main () 
{
    // cout = دستور خروجی ما 
    // << = عملگر درج در جریان 
    cout << "1 2 3 4 " ; 
    cout << endl; 

    cout << "1" << " 2" << " 3" << " 4" ; 
    cout << endl; 

    cout << "1"   ; 
    cout << " 2"  ; 
    cout << " 3"  ; 
    cout << " 4"  ; 
 }